Repository: millerin/FileRenamerDiff
Catalog: src/FileRenamerDiff/Properties/Resources.*.resx
Languages: ja, ru, zh

# Setting_FileSearch
source: File Search
ja: ファイル探索
ru: Поиск файлов
zh: 檔案搜尋

# Setting_SearchSubDirectories
source: Search Sub Directories
ja: サブフォルダ以下も探索する
ru: Поиск подкаталогов
zh: 搜索子目录

# Setting_IgnoreDirectory
source: Ignore Directory
ja: フォルダ自体もリネームする
ru: Переименовать каталоги
zh: 忽略目录

# Setting_IgnoreExtensions
source: Ignore Extensions
ja: 無視する拡張子
ru: Игнорировать расширения
zh: 忽略扩展版

# Setting_Add
source: ADD
ja: 追加
ru: Добавить
zh: 新增

# Setting_DeleteTexts
source: Delete Texts
ja: 削除する文字
ru: Удалить символы
zh: 删除文本

# Setting_AsExpression
source: Regular Expression
ja: 正規表現
ru: Регулярное выражение
zh: 規則運算式

# Setting_ReplacePatterns
source: Replace Patterns
ja: 置換パターン
ru: Модели замещения
zh: 替换模式

# Setting_ReplaceTextTarget
source: Target Text
ja: 置換前
ru: Текст цели
zh: 目标文本

# Setting_ReplaceText
source: Replace Text
ja: 置換後
ru: После замещения
zh: 替换文本

# Setting_ResetAllSetting
source: Reset ALL Settings
ja: 全設定の初期化
ru: Сброс всех настроек
zh: 重置所有设置

# Setting_Other
source: Other
ja: その他
ru: Другие
zh: 其他

# Menu_SearchFiles
source: Search Files
ja: ファイル探索実行
ru: Поиск файлов
zh: 搜索文件

# Menu_DryRun
source: DRY RUN
ja: リネームプレビュー
ru: пробный прогон
zh: 試執行

# Menu_Save
source: SAVE
ja: リネーム保存
ru: Сохранить
zh: 保存重命名

# Grid_OldText
source: OLD File Name
ja: 現在のファイル名
ru: Старое имя файла
zh: 旧文件名

# Grid_NewText
source: NEW File Name
ja: 新しいファイル名
ru: Новое имя файла
zh: 新文件名

# Grid_Changed
source: Mark with change A check mark is displayed if there are any changes.
ja: 変更ありマーク 変更があれば、チェックマークが表示される。
ru: Знак наличия изменений При наличии изменений отображается флажок.
zh: 复选标记 如有更改，则显示复选标记。

# Grid_Conflicted
source: Mark with duplicate If there are duplicates, a duplicate mark is displayed.
ja: 重複ありマーク 重複があれば、重複マークが表示される。
ru: Знак наличия дубликатов Если дубликаты есть, то отображается знак дубликата.
zh: 重复标记 如果有重复的文件，会显示重复的标记。

# Grid_DateModified
source: Date modified
ja: 更新日時
ru: Дата изменения
zh: 修改日期

# Grid_CreatedDate
source: Created Date
ja: 作成日時
ru: Дата создания
zh: 建立日期

# Setting_SettingTab
source: Settings
ja: 設定
ru: Настройки
zh: 设置

# Setting_DeleteTextTarget
source: Text
ja: 削除文字
ru: Текст
zh: 删除文本

# Grid_Directory
source: Directory
ja: ディレクトリ
ru: каталог
zh: 目录

# Grid_Size
source: Size
ja: サイズ
ru: Размер
zh: 大小

# Alert_FailSaveSetting
source: FAILED to save settings.
ja: 設定の保存に失敗しました。
ru: Не удалось сохранить настройки.
zh: 保存设置失败。

# Alert_FailSaveRename
source: FAILED to save rename.
ja: リネーム保存に失敗しました。
ru: Не удалось сохранить переименование.
zh: 重命名失败，无法保存。

# Info_SettingsReset
source: Settings were reset.
ja: 設定がリセットされました。
ru: Настройки были сброшены.
zh: 设置被重置。

# Alert_FileNamesDuplicated
source: Some file names are DUPLICATED.
ja: 一部のファイル名が重複しています。
ru: Некоторые имена файлов дублируются.
zh: 有些文件名是重复的。

# Alert_InvalidFileName
source: The output file name contains invalid file-name characters.
ja: 出力ファイル名に無効な文字が含まれています。
ru: Имя файла содержит недопустимые символы.
zh: 輸出檔名稱含有無效的檔名字元。

# Setting_ClearAll
source: CLEAR ALL
ja: 全削除
ru: Очистить все
zh: 彻底删除

# Alert_ConfirmClearBody
source: Are you sure you want to clear table?
ja: テーブルをクリアしてもよろしいですか?
ru: Действительно очистить таблицу?
zh: 是否确实要清除表?

# Alert_ConfirmClearHead
source: Confirm
ja: 確認
ru: Подтвердить
zh: 确认

# Windows_CopyFileSuffix
source: -copy
ja: - コピー
ru: -копия
zh: -複製

# Alert_NotFoundFileBody
source: Files could not be found.
ja: ファイルが見つかりませんでした。
ru: Файлы не удалось найти.
zh: 文件找不到了。

# Hint_SelectTargetDirectory
source: Select the target directory from the left button, or Drag-Drop.
ja: 左のボタンから対象のディレクトリを選択するか、ドラッグ アンド ドロップしてください。
ru: Выберите целевой каталог с помощью левой кнопки или перетащите его.
zh: 从左边的按钮中选择目标目录，或者拖动。

# Setting_IgnoreFileTypes
source: File types to rename
ja: リネームするファイル種類
ru: Типы файлов для переименования
zh: 要重命名的文件类型

# Setting_FileTypeHidden
source: Hidden
ja: 隠しファイル
ru: Скрытый
zh: 隐藏

# Setting_FileTypeDirectory
source: Folder
ja: フォルダ
ru: Папку
zh: 文件夹

# Setting_FileTypeFile
source: File
ja: ファイル
ru: Файловая
zh: 文件

# Windows_ShortcutFileSuffix
source: - Shortcut
ja: - ショートカット
ru: - Ярлык
zh: - 快捷方式

# Setting_ImportSettingFile
source: Import Settings
ja: 設定のインポート
ru: Импорт настроек
zh: 导入设置

# Setting_ExportSettingFile
source: Export Settings
ja: 設定のエクスポート
ru: Экспорт настроек
zh: 导出设置

# Common_DeleteWindowsCopyTag
source: Delete the "copy" tag in Windows
ja: Windowsのコピータグを削除する
ru: Удалить тэг "копия" в Windows
zh: 删除Windows中的 "複製" 标签

# Common_DeleteWindowsShortcutTag
source: Delete the "shortcut" tag in Windows
ja: Windowsのショートカットタグを削除する
ru: Удалить тэг "Ярлык" в Windows
zh: 删除Windows中的 "快捷方式" 标签

# Common_DeleteWindowsNumberTag
source: Delete Windows "(number)" tag
ja: Windowsの(数字)タグを削除する
ru: Удалить тэг "(номер)" в Windows
zh: 删除Windows中的 "(数字)" 标签

# Common_DeleteWhitespacesHeadTail
source: Delete whitespaces from the head and tail
ja: 先頭と末尾のスペースを削除する
ru: Удалить пробелы из головы и хвоста
zh: 删除头部和尾部的空格

# Common_DeleteExtention
source: Delete extension
ja: 拡張子の削除
ru: Удалить расширение
zh: 删去扩展名

# Common_SurroundWithSqureBrackets
source: Surround "ABC" with []
ja: "ABC"を[]で囲う
ru: Окружите "ABC" []
zh: 用[]包围"ABC"

# Common_ReduceWhiteSpace
source: Reduce spaces to a single space
ja: スペースを1つの半角スペースに減らす
ru: Сократить пространство до одного места
zh: 将空间减少到一个单一空间

# Common_ReplaceWhiteSpacesWithUnderbar
source: Replace whitespace with '_'
ja: 空白を'_'に置き換える
ru: Замените пробел на "_"
zh: 用'_'代替空格

# Common_AddThreeZero
source: Add three '0' to the number (three-digit zero padding 1/2)
ja: 数字に'0'を3つ追加する (3桁のゼロ埋め 1/2)
ru: Добавьте три '0' к числу (трехзначный нулевой отступ 1/2)
zh: 在数字上加3个 "0"（三位数的零垫1/2）

# Common_TakeNumberThreeDigits
source: Reduce the number to three digits (padding of three zeros 2/2)
ja: 数字を3桁に減らす (3桁のゼロ埋め 2/2)
ru: Уменьшите число до трех цифр (трехзначный нулевой отступ 2/2)
zh: 把数字减少到三位数（三位数的零垫2/2）

# Common_ReplaceAllExtentionToABC
source: Replace extension with "ABC"
ja: 拡張子を"ABC"に置き換える
ru: Замените расширение на "ABC"
zh: 将分机改为"ABC"

# Common_DeleteIgnoreCase
source: Delete "ABC" in a case-insensitive
ja: 大文字小文字を区別せずに"ABC"を削除する
ru: Удалить "ABC" с учетом регистра
zh: 删除不区分大小写的 "ABC"

# Common_ReplaceIgnoreCase
source: Replace "ABC" with "x" in a case-insensitive
ja: 大文字小文字を区別せずに"ABC"を”x"に置換する
ru: Замените "ABC" на "x" в случае нечувствительности к регистру
zh: 将 "ABC "改为 "x"，不区分大小写

# Setting_CommonPatterns
source: A collection of common patterns
ja: よくあるパターン集
ru: Коллекция общих закономерностей
zh: 常见模式的集合

# Common_DeleteWhitespacesBeforeSymbol
source: Delete spaces before a symbol
ja: 記号の前の空白を削除する
ru: Удалить пробелы перед символом
zh: 删除符号前的空格

# Common_DeleteWhitespacesInsideBrace
source: Delete the spaces inside the brackets
ja: 括弧の内側の空白を削除する
ru: Удалить пробелы в скобках
zh: 删除括号内的空格

# Common_DeleteBeforeExtension
source: Delete characters before the extension
ja: 拡張子より前の文字を削除する
ru: Удалить символы перед расширением
zh: 删除扩展名前的字符

# Common_DeleteAll
source: Delete all characters
ja: 全ての文字を削除する
ru: Удалить все символы
zh: 删除所有字符

# Setting_IsCreateRenameLog
source: Create a log file when renaming
ja: リネーム時にログファイルを作成する
ru: Создайте лог-файл при переименовании
zh: 重命名时创建一个日志文件

# Info_FileRemoved
source: After saving the rename, some files were removed from the list.
ja: リネーム保存後に、一部のファイルがリストから除かれました。
ru: После сохранения переименования некоторые файлы были удалены из списка.
zh: 保存重命名后，一些文件被从列表中删除。

# Menu_AddFiles
source: Add Files
ja: ファイル追加
ru: Добавить Файлы
zh: 添加文件

# Grid_DropDescription
source: 1. Target file specification You can drag and drop files here, or "Search Files" from a specific directory. 2. Set rename pattern Set the Delete/Replace pattern from "Settings". 3. Confirm rename Execute "DRY RUN" to confirm the renaming. 4. Execute rename. Execute "SAVE" to rename the actual file.
ja: 1. 対象ファイルの指定 ここにファイルをドラッグ＆ドロップしたり、特定のディレクトリから「ファイル探索実行」したりすることができます。 2. リネームパターンの設定 「設定」から削除/置換パターンを設定します。 3. 名前の変更を確認する 「プレビュー」を実行して名前の変更を確認します。 4. リネームを実行します。 「リネーム保存」を実行して、実際のファイル名を変更します。
ru: 1. Определить целевой файл Вы можете перетащить файлы в список файлов или выполнить <Поиск файлов> в определенном каталоге. 2. Установить шаблон переименования Установите шаблон "Удалить/Заменить" в разделе <Настройки>. 3. Подтвердить переименование Выполните <пробный прогон>, чтобы подтвердить переименование. 4. Выполнить переименование Выполните <Сохранить>, чтобы фактически переименовать файл.
zh: 1. 目标文件规格 您可以在这里拖放文件，或者从特定目录中 "檔案搜尋"。 2. 设置重命名模式 从 "设置 "中设置删除/替换模式。 3. 确认重命名 执行 "試執行"，确认重命名。 4. 执行 "重命名"。 执行 "保存重命名"来重命名实际文件。

# Menu_SearchFilesHint
source: Search files in the target directory on the left.
ja: 左側の対象ディレクトリ内のファイルを検索します。
ru: Поиск файлов в целевом каталоге слева.
zh: 在左边的目标目录中搜索文件。

# Menu_AddFilesHint
source: Directly specify the files to be renamed.
ja: リネームするファイルを直接指定する。
ru: Непосредственно укажите файлы для переименования.
zh: 直接指定要重命名的文件。

# Menu_DryRunHint
source: Change only on the list below, do not save to storage yet.
ja: 下のリスト上でのみ変更し、ストレージにはまだ保存しない。
ru: Изменяйте только в списке ниже, пока не сохраняйте в память.
zh: 只在下面的列表中更改，还没有保存到存储。

# Menu_SaveHint
source: Save to storage.
ja: ストレージに保存する。
ru: Сохранить на хранение.
zh: 保存到存储。

# Setting_IsRenameExt
source: Rename file extensions as well
ja: ファイルの拡張子もリネームする
ru: Переименовать и расширения файлов
zh: 重命名文件扩展名

# Common_ReplaceLowerCase
source: Convert all text to lower-case
ja: すべてのテキストを小文字に変換する
ru: Конвертировать весь текст в нижний регистр
zh: 将所有文本转换为小写

# Common_ReplaceUpperCase
source: Convert all text to upper-case
ja: すべてのテキストを大文字に変換する
ru: Конвертировать весь текст в верхний регистр
zh: 将所有文本转换为大写

# Common_ReplaceTitleCase
source: Convert all text to title-case
ja: すべてのテキストをタイトルケースに変換する
ru: Конвертировать весь текст в заголовок
zh: 将所有文本转换为标题大小写

# Common_ReplaceWide
source: Convert all letters and numbers to Full-width characters
ja: すべての英数字を全角に変換する
ru: Преобразовать все буквы и цифры в символы полной ширины
zh: 将所有字母和数字转换为全角字符

# Common_ReplaceHalf
source: Convert all letters and numbers to Half-width characters
ja: すべての英数字を半角に変換する
ru: Преобразовать все буквы и цифры в символы полуширины
zh: 将所有字母和数字转换为半角字符

# Common_ReplaceUmulaut
source: Convert umlauts to plain-ascii characters
ja: ウムラウトをASCII英字に変換する
ru: Конвертировать умлауты в обычные символы
zh: 将umlauts转换为纯正的ascii字符

# Common_ReplaceHanKana
source: Convert all Half-width Katakana to full-width
ja: すべての半角カタカナを全角に変換する
ru: Преобразовать всю Катакана полуширины в полную ширину
zh: 将所有半幅片假名转换为全幅

# Common_InsertIndex
source: Insert "XYZ" as the third character
ja: 3文字目に「XYZ」を挿入する
ru: Вставьте "XYZ" в качестве третьего символа
zh: 插入 "XYZ "作为第三个字符

# Grid_FileType
source: File Type
ja: ファイル種類
zh: 文件类型

# Common_AddDirectoryNameBeginning
source: Add the directory name at the beginning
ja: ディレクトリ名を先頭に追加
zh: 在开头添加目录名称

# Common_AddDirectoryNameBeforeExtension
source: Add the directory name before the extension
ja: 拡張子の手前にディレクトリ名を追加
zh: 在扩展名之前添加目录名

# AddingSerial_StartNumber
source: Start Number:
ja: 開始番号:

# AddingSerial_AddingSerialNumber
source: Adding serial numbers
ja: 連番追加

# AddingSerial_ZeroPaddingDigits
source: Zero-Padding Digits:
ja: ゼロ詰め桁数:

# AddingSerial_Step
source: Step:
ja: ステップ数:

# AddingSerial_ResetPerFolder
source: Reset per Folder:
ja: フォルダごとリセット:

# AddingSerial_Inverse
source: Inverse:
ja: 逆順:

# AddingSerial_GenaratedPattern
source: Genarated Pattern
ja: 生成された置換パターン

# AddingSerial_PrefixText
source: Prefix Text:
ja: 前置き文字列:

# AddingSerial_PostfixText
source: Postfix Text:
ja: 後置き文字列:
